SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_letimer.h
/* Bit fields for LETIMER STATUS */
#define _LETIMER_STATUS_RESETVALUE              0x00000000UL                            /**< Default value for LETIMER_STATUS            */
#define _LETIMER_STATUS_MASK                    0x00000003UL                            /**< Mask for LETIMER_STATUS                     */
#define LETIMER_STATUS_RUNNING                  (0x1UL << 0)                            /**< LETIMER Running                             */
#define _LETIMER_STATUS_RUNNING_SHIFT           0                                       /**< Shift value for LETIMER_RUNNING             */
#define _LETIMER_STATUS_RUNNING_MASK            0x1UL                                   /**< Bit mask for LETIMER_RUNNING                */
#define _LETIMER_STATUS_RUNNING_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for LETIMER_STATUS             */
#define LETIMER_STATUS_RUNNING_DEFAULT          (_LETIMER_STATUS_RUNNING_DEFAULT << 0)  /**< Shifted mode DEFAULT for LETIMER_STATUS     */
#define LETIMER_STATUS_LETIMERLOCKSTATUS        (0x1UL << 1)                            /**< LETIMER Lock Status                         */
#define _LETIMER_STATUS_LETIMERLOCKSTATUS_SHIFT 1                                       /**< Shift value for LETIMER_LETIMERLOCKSTATUS   */
#define _LETIMER_STATUS_LETIMERLOCKSTATUS_MASK  0x2UL                                   /**< Bit mask for LETIMER_LETIMERLOCKSTATUS      */
#define _LETIMER_STATUS_LETIMERLOCKSTATUS_DEFAULT 0x00000000UL                            /**< Mode DEFAULT for LETIMER_STATUS             */
#define _LETIMER_STATUS_LETIMERLOCKSTATUS_UNLOCKED 0x00000000UL                            /**< Mode UNLOCKED for LETIMER_STATUS            */
#define _LETIMER_STATUS_LETIMERLOCKSTATUS_LOCKED 0x00000001UL                            /**< Mode LOCKED for LETIMER_STATUS              */
#define LETIMER_STATUS_LETIMERLOCKSTATUS_DEFAULT (_LETIMER_STATUS_LETIMERLOCKSTATUS_DEFAULT << 1) /**< Shifted mode DEFAULT for LETIMER_STATUS     */
#define LETIMER_STATUS_LETIMERLOCKSTATUS_UNLOCKED (_LETIMER_STATUS_LETIMERLOCKSTATUS_UNLOCKED << 1) /**< Shifted mode UNLOCKED for LETIMER_STATUS    */
#define LETIMER_STATUS_LETIMERLOCKSTATUS_LOCKED (_LETIMER_STATUS_LETIMERLOCKSTATUS_LOCKED << 1) /**< Shifted mode LOCKED for LETIMER_STATUS      */

/* Bit fields for LETIMER CNT */
#define _LETIMER_CNT_RESETVALUE                 0x00000000UL                            /**< Default value for LETIMER_CNT               */
#define _LETIMER_CNT_MASK                       0x00FFFFFFUL                            /**< Mask for LETIMER_CNT                        */
#define _LETIMER_CNT_CNT_SHIFT                  0                                       /**< Shift value for LETIMER_CNT                 */
#define _LETIMER_CNT_CNT_MASK                   0xFFFFFFUL                              /**< Bit mask for LETIMER_CNT                    */
#define _LETIMER_CNT_CNT_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LETIMER_CNT                */
#define LETIMER_CNT_CNT_DEFAULT                 (_LETIMER_CNT_CNT_DEFAULT << 0)         /**< Shifted mode DEFAULT for LETIMER_CNT        */

/* Bit fields for LETIMER COMP0 */
#define _LETIMER_COMP0_RESETVALUE               0x00000000UL                            /**< Default value for LETIMER_COMP0             */
#define _LETIMER_COMP0_MASK                     0x00FFFFFFUL                            /**< Mask for LETIMER_COMP0                      */
#define _LETIMER_COMP0_COMP0_SHIFT              0                                       /**< Shift value for LETIMER_COMP0               */
#define _LETIMER_COMP0_COMP0_MASK               0xFFFFFFUL                              /**< Bit mask for LETIMER_COMP0                  */
#define _LETIMER_COMP0_COMP0_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LETIMER_COMP0              */
#define LETIMER_COMP0_COMP0_DEFAULT             (_LETIMER_COMP0_COMP0_DEFAULT << 0)     /**< Shifted mode DEFAULT for LETIMER_COMP0      */

/* Bit fields for LETIMER COMP1 */
#define _LETIMER_COMP1_RESETVALUE               0x00000000UL                            /**< Default value for LETIMER_COMP1             */
#define _LETIMER_COMP1_MASK                     0x00FFFFFFUL                            /**< Mask for LETIMER_COMP1                      */
#define _LETIMER_COMP1_COMP1_SHIFT              0                                       /**< Shift value for LETIMER_COMP1               */
#define _LETIMER_COMP1_COMP1_MASK               0xFFFFFFUL                              /**< Bit mask for LETIMER_COMP1                  */
#define _LETIMER_COMP1_COMP1_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LETIMER_COMP1              */
#define LETIMER_COMP1_COMP1_DEFAULT             (_LETIMER_COMP1_COMP1_DEFAULT << 0)     /**< Shifted mode DEFAULT for LETIMER_COMP1      */

/* Bit fields for LETIMER TOP */
#define _LETIMER_TOP_RESETVALUE                 0x00000000UL                            /**< Default value for LETIMER_TOP               */
#define _LETIMER_TOP_MASK                       0x00FFFFFFUL                            /**< Mask for LETIMER_TOP                        */
#define _LETIMER_TOP_TOP_SHIFT                  0                                       /**< Shift value for LETIMER_TOP                 */
#define _LETIMER_TOP_TOP_MASK                   0xFFFFFFUL                              /**< Bit mask for LETIMER_TOP                    */
#define _LETIMER_TOP_TOP_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LETIMER_TOP                */
#define LETIMER_TOP_TOP_DEFAULT                 (_LETIMER_TOP_TOP_DEFAULT << 0)         /**< Shifted mode DEFAULT for LETIMER_TOP        */

/* Bit fields for LETIMER TOPBUFF */
#define _LETIMER_TOPBUFF_RESETVALUE             0x00000000UL                            /**< Default value for LETIMER_TOPBUFF           */
#define _LETIMER_TOPBUFF_MASK                   0x00FFFFFFUL                            /**< Mask for LETIMER_TOPBUFF                    */
#define _LETIMER_TOPBUFF_TOPBUFF_SHIFT          0                                       /**< Shift value for LETIMER_TOPBUFF             */
#define _LETIMER_TOPBUFF_TOPBUFF_MASK           0xFFFFFFUL                              /**< Bit mask for LETIMER_TOPBUFF                */
#define _LETIMER_TOPBUFF_TOPBUFF_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for LETIMER_TOPBUFF            */
#define LETIMER_TOPBUFF_TOPBUFF_DEFAULT         (_LETIMER_TOPBUFF_TOPBUFF_DEFAULT << 0) /**< Shifted mode DEFAULT for LETIMER_TOPBUFF    */

/* Bit fields for LETIMER REP0 */
#define _LETIMER_REP0_RESETVALUE                0x00000000UL                            /**< Default value for LETIMER_REP0              */
#define _LETIMER_REP0_MASK                      0x000000FFUL                            /**< Mask for LETIMER_REP0                       */
#define _LETIMER_REP0_REP0_SHIFT                0                                       /**< Shift value for LETIMER_REP0                */
#define _LETIMER_REP0_REP0_MASK                 0xFFUL                                  /**< Bit mask for LETIMER_REP0                   */
#define _LETIMER_REP0_REP0_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for LETIMER_REP0               */
#define LETIMER_REP0_REP0_DEFAULT               (_LETIMER_REP0_REP0_DEFAULT << 0)       /**< Shifted mode DEFAULT for LETIMER_REP0       */

/* Bit fields for LETIMER REP1 */
#define _LETIMER_REP1_RESETVALUE                0x00000000UL                            /**< Default value for LETIMER_REP1              */
#define _LETIMER_REP1_MASK                      0x000000FFUL                            /**< Mask for LETIMER_REP1                       */
#define _LETIMER_REP1_REP1_SHIFT                0                                       /**< Shift value for LETIMER_REP1                */
#define _LETIMER_REP1_REP1_MASK                 0xFFUL                                  /**< Bit mask for LETIMER_REP1                   */
#define _LETIMER_REP1_REP1_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for LETIMER_REP1               */
#define LETIMER_REP1_REP1_DEFAULT               (_LETIMER_REP1_REP1_DEFAULT << 0)       /**< Shifted mode DEFAULT for LETIMER_REP1       */

/* Bit fields for LETIMER IF */
#define _LETIMER_IF_RESETVALUE                  0x00000000UL                            /**< Default value for LETIMER_IF                */
#define _LETIMER_IF_MASK                        0x0000001FUL                            /**< Mask for LETIMER_IF                         */
#define LETIMER_IF_COMP0                        (0x1UL << 0)                            /**< Compare Match 0 Interrupt Flag              */
#define _LETIMER_IF_COMP0_SHIFT                 0                                       /**< Shift value for LETIMER_COMP0               */
#define _LETIMER_IF_COMP0_MASK                  0x1UL                                   /**< Bit mask for LETIMER_COMP0                  */
#define _LETIMER_IF_COMP0_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for LETIMER_IF                 */
#define LETIMER_IF_COMP0_DEFAULT                (_LETIMER_IF_COMP0_DEFAULT << 0)        /**< Shifted mode DEFAULT for LETIMER_IF         */
#define LETIMER_IF_COMP1                        (0x1UL << 1)                            /**< Compare Match 1 Interrupt Flag              */
#define _LETIMER_IF_COMP1_SHIFT                 1                                       /**< Shift value for LETIMER_COMP1               */
#define _LETIMER_IF_COMP1_MASK                  0x2UL                                   /**< Bit mask for LETIMER_COMP1                  */
#define _LETIMER_IF_COMP1_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for LETIMER_IF                 */
#define LETIMER_IF_COMP1_DEFAULT                (_LETIMER_IF_COMP1_DEFAULT << 1)        /**< Shifted mode DEFAULT for LETIMER_IF         */
#define LETIMER_IF_UF                           (0x1UL << 2)                            /**< Underflow Interrupt Flag                    */
#define _LETIMER_IF_UF_SHIFT                    2                                       /**< Shift value for LETIMER_UF                  */
#define _LETIMER_IF_UF_MASK                     0x4UL                                   /**< Bit mask for LETIMER_UF                     */
#define _LETIMER_IF_UF_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for LETIMER_IF                 */
#define LETIMER_IF_UF_DEFAULT                   (_LETIMER_IF_UF_DEFAULT << 2)           /**< Shifted mode DEFAULT for LETIMER_IF         */
#define LETIMER_IF_REP0                         (0x1UL << 3)                            /**< Repeat Counter 0 Interrupt Flag             */
#define _LETIMER_IF_REP0_SHIFT                  3                                       /**< Shift value for LETIMER_REP0                */
#define _LETIMER_IF_REP0_MASK                   0x8UL                                   /**< Bit mask for LETIMER_REP0                   */
#define _LETIMER_IF_REP0_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LETIMER_IF                 */
#define LETIMER_IF_REP0_DEFAULT                 (_LETIMER_IF_REP0_DEFAULT << 3)         /**< Shifted mode DEFAULT for LETIMER_IF         */
#define LETIMER_IF_REP1                         (0x1UL << 4)                            /**< Repeat Counter 1 Interrupt Flag             */
#define _LETIMER_IF_REP1_SHIFT                  4                                       /**< Shift value for LETIMER_REP1                */
#define _LETIMER_IF_REP1_MASK                   0x10UL                                  /**< Bit mask for LETIMER_REP1                   */
#define _LETIMER_IF_REP1_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for LETIMER_IF                 */
#define LETIMER_IF_REP1_DEFAULT                 (_LETIMER_IF_REP1_DEFAULT << 4)         /**< Shifted mode DEFAULT for LETIMER_IF         */

/* Bit fields for LETIMER IEN */
#define _LETIMER_IEN_RESETVALUE                 0x00000000UL                            /**< Default value for LETIMER_IEN               */
#define _LETIMER_IEN_MASK                       0x0000001FUL                            /**< Mask for LETIMER_IEN                        */
#define LETIMER_IEN_COMP0                       (0x1UL << 0)                            /**< Compare Match 0 Interrupt Enable            */
#define _LETIMER_IEN_COMP0_SHIFT                0                                       /**< Shift value for LETIMER_COMP0               */
#define _LETIMER_IEN_COMP0_MASK                 0x1UL                                   /**< Bit mask for LETIMER_COMP0                  */
#define _LETIMER_IEN_COMP0_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for LETIMER_IEN                */
#define LETIMER_IEN_COMP0_DEFAULT               (_LETIMER_IEN_COMP0_DEFAULT << 0)       /**< Shifted mode DEFAULT for LETIMER_IEN        */
#define LETIMER_IEN_COMP1                       (0x1UL << 1)                            /**< Compare Match 1 Interrupt Enable            */
#define _LETIMER_IEN_COMP1_SHIFT                1                                       /**< Shift value for LETIMER_COMP1               */
#define _LETIMER_IEN_COMP1_MASK                 0x2UL                                   /**< Bit mask for LETIMER_COMP1                  */
#define _LETIMER_IEN_COMP1_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for LETIMER_IEN                */
#define LETIMER_IEN_COMP1_DEFAULT               (_LETIMER_IEN_COMP1_DEFAULT << 1)       /**< Shifted mode DEFAULT for LETIMER_IEN        */
#define LETIMER_IEN_UF                          (0x1UL << 2)                            /**< Underflow Interrupt Enable                  */
#define _LETIMER_IEN_UF_SHIFT                   2                                       /**< Shift value for LETIMER_UF                  */
#define _LETIMER_IEN_UF_MASK                    0x4UL                                   /**< Bit mask for LETIMER_UF                     */
#define _LETIMER_IEN_UF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for LETIMER_IEN                */
#define LETIMER_IEN_UF_DEFAULT                  (_LETIMER_IEN_UF_DEFAULT << 2)          /**< Shifted mode DEFAULT for LETIMER_IEN        */
#define LETIMER_IEN_REP0                        (0x1UL << 3)                            /**< Repeat Counter 0 Interrupt Enable           */
#define _LETIMER_IEN_REP0_SHIFT                 3                                       /**< Shift value for LETIMER_REP0                */
#define _LETIMER_IEN_REP0_MASK                  0x8UL                                   /**< Bit mask for LETIMER_REP0                   */
#define _LETIMER_IEN_REP0_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for LETIMER_IEN                */
#define LETIMER_IEN_REP0_DEFAULT                (_LETIMER_IEN_REP0_DEFAULT << 3)        /**< Shifted mode DEFAULT for LETIMER_IEN        */
#define LETIMER_IEN_REP1                        (0x1UL << 4)                            /**< Repeat Counter 1 Interrupt Enable           */
#define _LETIMER_IEN_REP1_SHIFT                 4                                       /**< Shift value for LETIMER_REP1                */
#define _LETIMER_IEN_REP1_MASK                  0x10UL                                  /**< Bit mask for LETIMER_REP1                   */
#define _LETIMER_IEN_REP1_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for LETIMER_IEN                */
#define LETIMER_IEN_REP1_DEFAULT                (_LETIMER_IEN_REP1_DEFAULT << 4)        /**< Shifted mode DEFAULT for LETIMER_IEN        */

