SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_letimer.h
/* Bit fields for LETIMER LOCK */
#define _LETIMER_LOCK_RESETVALUE                0x00000000UL                            /**< Default value for LETIMER_LOCK              */
#define _LETIMER_LOCK_MASK                      0x0000FFFFUL                            /**< Mask for LETIMER_LOCK                       */
#define _LETIMER_LOCK_LETIMERLOCKKEY_SHIFT      0                                       /**< Shift value for LETIMER_LETIMERLOCKKEY      */
#define _LETIMER_LOCK_LETIMERLOCKKEY_MASK       0xFFFFUL                                /**< Bit mask for LETIMER_LETIMERLOCKKEY         */
#define _LETIMER_LOCK_LETIMERLOCKKEY_DEFAULT    0x00000000UL                            /**< Mode DEFAULT for LETIMER_LOCK               */
#define _LETIMER_LOCK_LETIMERLOCKKEY_UNLOCK     0x0000CCFCUL                            /**< Mode UNLOCK for LETIMER_LOCK                */
#define LETIMER_LOCK_LETIMERLOCKKEY_DEFAULT     (_LETIMER_LOCK_LETIMERLOCKKEY_DEFAULT << 0) /**< Shifted mode DEFAULT for LETIMER_LOCK       */
#define LETIMER_LOCK_LETIMERLOCKKEY_UNLOCK      (_LETIMER_LOCK_LETIMERLOCKKEY_UNLOCK << 0) /**< Shifted mode UNLOCK for LETIMER_LOCK        */

/* Bit fields for LETIMER SYNCBUSY */
#define _LETIMER_SYNCBUSY_RESETVALUE            0x00000000UL                            /**< Default value for LETIMER_SYNCBUSY          */
#define _LETIMER_SYNCBUSY_MASK                  0x000003FDUL                            /**< Mask for LETIMER_SYNCBUSY                   */
#define LETIMER_SYNCBUSY_CNT                    (0x1UL << 0)                            /**< Sync busy for CNT                           */
#define _LETIMER_SYNCBUSY_CNT_SHIFT             0                                       /**< Shift value for LETIMER_CNT                 */
#define _LETIMER_SYNCBUSY_CNT_MASK              0x1UL                                   /**< Bit mask for LETIMER_CNT                    */
#define _LETIMER_SYNCBUSY_CNT_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_CNT_DEFAULT            (_LETIMER_SYNCBUSY_CNT_DEFAULT << 0)    /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */
#define LETIMER_SYNCBUSY_TOP                    (0x1UL << 2)                            /**< Sync busy for TOP                           */
#define _LETIMER_SYNCBUSY_TOP_SHIFT             2                                       /**< Shift value for LETIMER_TOP                 */
#define _LETIMER_SYNCBUSY_TOP_MASK              0x4UL                                   /**< Bit mask for LETIMER_TOP                    */
#define _LETIMER_SYNCBUSY_TOP_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_TOP_DEFAULT            (_LETIMER_SYNCBUSY_TOP_DEFAULT << 2)    /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */
#define LETIMER_SYNCBUSY_REP0                   (0x1UL << 3)                            /**< Sync busy for REP0                          */
#define _LETIMER_SYNCBUSY_REP0_SHIFT            3                                       /**< Shift value for LETIMER_REP0                */
#define _LETIMER_SYNCBUSY_REP0_MASK             0x8UL                                   /**< Bit mask for LETIMER_REP0                   */
#define _LETIMER_SYNCBUSY_REP0_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_REP0_DEFAULT           (_LETIMER_SYNCBUSY_REP0_DEFAULT << 3)   /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */
#define LETIMER_SYNCBUSY_REP1                   (0x1UL << 4)                            /**< Sync busy for REP1                          */
#define _LETIMER_SYNCBUSY_REP1_SHIFT            4                                       /**< Shift value for LETIMER_REP1                */
#define _LETIMER_SYNCBUSY_REP1_MASK             0x10UL                                  /**< Bit mask for LETIMER_REP1                   */
#define _LETIMER_SYNCBUSY_REP1_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_REP1_DEFAULT           (_LETIMER_SYNCBUSY_REP1_DEFAULT << 4)   /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */
#define LETIMER_SYNCBUSY_START                  (0x1UL << 5)                            /**< Sync busy for START                         */
#define _LETIMER_SYNCBUSY_START_SHIFT           5                                       /**< Shift value for LETIMER_START               */
#define _LETIMER_SYNCBUSY_START_MASK            0x20UL                                  /**< Bit mask for LETIMER_START                  */
#define _LETIMER_SYNCBUSY_START_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_START_DEFAULT          (_LETIMER_SYNCBUSY_START_DEFAULT << 5)  /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */
#define LETIMER_SYNCBUSY_STOP                   (0x1UL << 6)                            /**< Sync busy for STOP                          */
#define _LETIMER_SYNCBUSY_STOP_SHIFT            6                                       /**< Shift value for LETIMER_STOP                */
#define _LETIMER_SYNCBUSY_STOP_MASK             0x40UL                                  /**< Bit mask for LETIMER_STOP                   */
#define _LETIMER_SYNCBUSY_STOP_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_STOP_DEFAULT           (_LETIMER_SYNCBUSY_STOP_DEFAULT << 6)   /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */
#define LETIMER_SYNCBUSY_CLEAR                  (0x1UL << 7)                            /**< Sync busy for CLEAR                         */
#define _LETIMER_SYNCBUSY_CLEAR_SHIFT           7                                       /**< Shift value for LETIMER_CLEAR               */
#define _LETIMER_SYNCBUSY_CLEAR_MASK            0x80UL                                  /**< Bit mask for LETIMER_CLEAR                  */
#define _LETIMER_SYNCBUSY_CLEAR_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_CLEAR_DEFAULT          (_LETIMER_SYNCBUSY_CLEAR_DEFAULT << 7)  /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */
#define LETIMER_SYNCBUSY_CTO0                   (0x1UL << 8)                            /**< Sync busy for CTO0                          */
#define _LETIMER_SYNCBUSY_CTO0_SHIFT            8                                       /**< Shift value for LETIMER_CTO0                */
#define _LETIMER_SYNCBUSY_CTO0_MASK             0x100UL                                 /**< Bit mask for LETIMER_CTO0                   */
#define _LETIMER_SYNCBUSY_CTO0_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_CTO0_DEFAULT           (_LETIMER_SYNCBUSY_CTO0_DEFAULT << 8)   /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */
#define LETIMER_SYNCBUSY_CTO1                   (0x1UL << 9)                            /**< Sync busy for CTO1                          */
#define _LETIMER_SYNCBUSY_CTO1_SHIFT            9                                       /**< Shift value for LETIMER_CTO1                */
#define _LETIMER_SYNCBUSY_CTO1_MASK             0x200UL                                 /**< Bit mask for LETIMER_CTO1                   */
#define _LETIMER_SYNCBUSY_CTO1_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for LETIMER_SYNCBUSY           */
#define LETIMER_SYNCBUSY_CTO1_DEFAULT           (_LETIMER_SYNCBUSY_CTO1_DEFAULT << 9)   /**< Shifted mode DEFAULT for LETIMER_SYNCBUSY   */

/* Bit fields for LETIMER PRSMODE */
#define _LETIMER_PRSMODE_RESETVALUE             0x00000000UL                            /**< Default value for LETIMER_PRSMODE           */
#define _LETIMER_PRSMODE_MASK                   0x0CCC0000UL                            /**< Mask for LETIMER_PRSMODE                    */
#define _LETIMER_PRSMODE_PRSSTARTMODE_SHIFT     18                                      /**< Shift value for LETIMER_PRSSTARTMODE        */
#define _LETIMER_PRSMODE_PRSSTARTMODE_MASK      0xC0000UL                               /**< Bit mask for LETIMER_PRSSTARTMODE           */
#define _LETIMER_PRSMODE_PRSSTARTMODE_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for LETIMER_PRSMODE            */
#define _LETIMER_PRSMODE_PRSSTARTMODE_NONE      0x00000000UL                            /**< Mode NONE for LETIMER_PRSMODE               */
#define _LETIMER_PRSMODE_PRSSTARTMODE_RISING    0x00000001UL                            /**< Mode RISING for LETIMER_PRSMODE             */
#define _LETIMER_PRSMODE_PRSSTARTMODE_FALLING   0x00000002UL                            /**< Mode FALLING for LETIMER_PRSMODE            */
#define _LETIMER_PRSMODE_PRSSTARTMODE_BOTH      0x00000003UL                            /**< Mode BOTH for LETIMER_PRSMODE               */
#define LETIMER_PRSMODE_PRSSTARTMODE_DEFAULT    (_LETIMER_PRSMODE_PRSSTARTMODE_DEFAULT << 18) /**< Shifted mode DEFAULT for LETIMER_PRSMODE    */
#define LETIMER_PRSMODE_PRSSTARTMODE_NONE       (_LETIMER_PRSMODE_PRSSTARTMODE_NONE << 18) /**< Shifted mode NONE for LETIMER_PRSMODE       */
#define LETIMER_PRSMODE_PRSSTARTMODE_RISING     (_LETIMER_PRSMODE_PRSSTARTMODE_RISING << 18) /**< Shifted mode RISING for LETIMER_PRSMODE     */
#define LETIMER_PRSMODE_PRSSTARTMODE_FALLING    (_LETIMER_PRSMODE_PRSSTARTMODE_FALLING << 18) /**< Shifted mode FALLING for LETIMER_PRSMODE    */
#define LETIMER_PRSMODE_PRSSTARTMODE_BOTH       (_LETIMER_PRSMODE_PRSSTARTMODE_BOTH << 18) /**< Shifted mode BOTH for LETIMER_PRSMODE       */
#define _LETIMER_PRSMODE_PRSSTOPMODE_SHIFT      22                                      /**< Shift value for LETIMER_PRSSTOPMODE         */
#define _LETIMER_PRSMODE_PRSSTOPMODE_MASK       0xC00000UL                              /**< Bit mask for LETIMER_PRSSTOPMODE            */
#define _LETIMER_PRSMODE_PRSSTOPMODE_DEFAULT    0x00000000UL                            /**< Mode DEFAULT for LETIMER_PRSMODE            */
#define _LETIMER_PRSMODE_PRSSTOPMODE_NONE       0x00000000UL                            /**< Mode NONE for LETIMER_PRSMODE               */
#define _LETIMER_PRSMODE_PRSSTOPMODE_RISING     0x00000001UL                            /**< Mode RISING for LETIMER_PRSMODE             */
#define _LETIMER_PRSMODE_PRSSTOPMODE_FALLING    0x00000002UL                            /**< Mode FALLING for LETIMER_PRSMODE            */
#define _LETIMER_PRSMODE_PRSSTOPMODE_BOTH       0x00000003UL                            /**< Mode BOTH for LETIMER_PRSMODE               */
#define LETIMER_PRSMODE_PRSSTOPMODE_DEFAULT     (_LETIMER_PRSMODE_PRSSTOPMODE_DEFAULT << 22) /**< Shifted mode DEFAULT for LETIMER_PRSMODE    */
#define LETIMER_PRSMODE_PRSSTOPMODE_NONE        (_LETIMER_PRSMODE_PRSSTOPMODE_NONE << 22) /**< Shifted mode NONE for LETIMER_PRSMODE       */
#define LETIMER_PRSMODE_PRSSTOPMODE_RISING      (_LETIMER_PRSMODE_PRSSTOPMODE_RISING << 22) /**< Shifted mode RISING for LETIMER_PRSMODE     */
#define LETIMER_PRSMODE_PRSSTOPMODE_FALLING     (_LETIMER_PRSMODE_PRSSTOPMODE_FALLING << 22) /**< Shifted mode FALLING for LETIMER_PRSMODE    */
#define LETIMER_PRSMODE_PRSSTOPMODE_BOTH        (_LETIMER_PRSMODE_PRSSTOPMODE_BOTH << 22) /**< Shifted mode BOTH for LETIMER_PRSMODE       */
#define _LETIMER_PRSMODE_PRSCLEARMODE_SHIFT     26                                      /**< Shift value for LETIMER_PRSCLEARMODE        */
#define _LETIMER_PRSMODE_PRSCLEARMODE_MASK      0xC000000UL                             /**< Bit mask for LETIMER_PRSCLEARMODE           */
#define _LETIMER_PRSMODE_PRSCLEARMODE_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for LETIMER_PRSMODE            */
#define _LETIMER_PRSMODE_PRSCLEARMODE_NONE      0x00000000UL                            /**< Mode NONE for LETIMER_PRSMODE               */
#define _LETIMER_PRSMODE_PRSCLEARMODE_RISING    0x00000001UL                            /**< Mode RISING for LETIMER_PRSMODE             */
#define _LETIMER_PRSMODE_PRSCLEARMODE_FALLING   0x00000002UL                            /**< Mode FALLING for LETIMER_PRSMODE            */
#define _LETIMER_PRSMODE_PRSCLEARMODE_BOTH      0x00000003UL                            /**< Mode BOTH for LETIMER_PRSMODE               */
#define LETIMER_PRSMODE_PRSCLEARMODE_DEFAULT    (_LETIMER_PRSMODE_PRSCLEARMODE_DEFAULT << 26) /**< Shifted mode DEFAULT for LETIMER_PRSMODE    */
#define LETIMER_PRSMODE_PRSCLEARMODE_NONE       (_LETIMER_PRSMODE_PRSCLEARMODE_NONE << 26) /**< Shifted mode NONE for LETIMER_PRSMODE       */
#define LETIMER_PRSMODE_PRSCLEARMODE_RISING     (_LETIMER_PRSMODE_PRSCLEARMODE_RISING << 26) /**< Shifted mode RISING for LETIMER_PRSMODE     */
#define LETIMER_PRSMODE_PRSCLEARMODE_FALLING    (_LETIMER_PRSMODE_PRSCLEARMODE_FALLING << 26) /**< Shifted mode FALLING for LETIMER_PRSMODE    */
#define LETIMER_PRSMODE_PRSCLEARMODE_BOTH       (_LETIMER_PRSMODE_PRSCLEARMODE_BOTH << 26) /**< Shifted mode BOTH for LETIMER_PRSMODE       */

/** @} End of group EFR32SG23_LETIMER_BitFields */
/** @} End of group EFR32SG23_LETIMER */
/** @} End of group Parts */

#endif // EFR32SG23_LETIMER_H
